package SummerHomework;

import java.util.Scanner;

public class Demo30 {
    /*任务30：某国的个人所得税草案规定，个税的起征点为3000元，分成7级，税率情况见下表，从键盘上输入月工资，计算应交纳的个人所得税。
表1.6.1 税率情况表
级数	全月应纳税所得额	税率 (%)
1	不超过1500元的（即3000-4500之间）	5    3000-4500
2	超过1500元至4500元的部分	10           4500-9000
3	超过4500元至9000元的部分	20           9000-18000
4	超过9000元至35000元的部分	25           18000-53000
5	超过35000元至55000元的部分	30           53000-108000
6	超过55000元至80000元的部分	35          108000-180000
7	超过80000元的部分	45                 180000
注意：超出部分按所在税的级数计算，如：一个人的月收入为6000，应交个人所得税为：1500*0.05 +((6000-3000）-1500)*0.1=225
请在键盘上输入一个人的月收入，编程实现计算该公民所要交的税。
例如：输入“6000”，则输出“你要交的税为：225”。*/
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.println("请输入你的工资");
        double i = scanner.nextDouble();
        double j=0;
        double s=i-3000;
        if(s<=1500){
            j=s*0.05;
            System.out.println("你应交的税为:"+j);
        }else if(s<=4500){
            j=1500 *0.05+(s-1500)*0.1;
            System.out.println("你应交的税为:"+j);}
        else if(s<=9000){
            j=1500*0.05+3000*0.1+(s-4500)*0.2;
            System.out.println("你应交的税为:"+j);
        }
        else if(s<=35000){
            j=1500-0.05+3000*0.1+4500*0.2+(s-9000)*0.25;
            System.out.println("你应交的税为:"+j);}
        else if(s<=55000){
            j=1500*0.05+3000*0.1+4500*0.2+26000*0.25+(5-35000)*0.3;
            System.out.println("你应交的税为:"+j);}
        else if(s<=80000){
            j=1500-0.05+3000*0.1+4500-0.2+26000*0.25+20000*0.3+(s-55000)*0.35;
            System.out.println("你应交的税为:"+j);}
        else if (s>800000){
                j=1500*0.05+3000*0.1+4500*0.2+26000 *0.25+20000*0.3+25000*0.35+(s-80000)*0.45;

            System.out.println("你应交的税为:"+j);}
        else{
            System.out.println("不交税!");}
    }

}
